# Run your GitHub Actions locally
brew "act"
# Improved top (interactive process viewer)
brew "htop"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Object-relational database system
brew "postgresql@18", restart_service: true, link: true
# Persistent key-value database, with built-in net interface
brew "redis"
# Cross-shell prompt for astronauts
brew "starship"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Terminal-based AI coding assistant
cask "claude-code"
# Disk space visualizer
cask "daisydisk"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# JetBrainsMono Nerd Font families
cask "font-jetbrains-mono-nerd-font"
# MesloLG Nerd Font families (Meslo LG)
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Access the HEY email service
cask "hey"
# Utility to hide menu bar items
cask "hiddenbar"
# Host-based application firewall
cask "little-snitch"
# A Sophisticated CSV Editor/Viewer
cask "modern-csv"
# Native code editor
cask "nova"
# WebKit based web browser
cask "orion"
# General-purpose text editor
cask "textmate"
# File transfer application
cask "transmit"

# Mac App Store command-line interface
mas "Boop", id: 1518425043
mas "ColorSlurp", id: 1287239339
mas "Cooler", id: 677535539
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "HTML Editor", id: 1580431405
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "iWriter Pro", id: 893199093
mas "Keynote", id: 409183694
mas "Markdown Editor Pro", id: 1453295546
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
