# Run your GitHub Actions locally
brew "act"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql", restart_service: true
# AI coding agent, built for the terminal
brew "opencode"
# Object-relational database system
brew "postgresql@18", restart_service: true, link: true
# Persistent key-value database, with built-in net interface
brew "redis"
# Cross-shell prompt for astronauts
brew "starship"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Data backup and storage service
cask "backblaze"
# Terminal-based AI coding assistant
cask "claude-code"
# Disk space visualizer
cask "daisydisk"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# JetBrainsMono Nerd Font families
cask "font-jetbrains-mono-nerd-font"
# MesloLG Nerd Font families (Meslo LG)
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Access the HEY email service
cask "hey-desktop"
# Utility to hide menu bar items
cask "hiddenbar"
# Host-based application firewall
cask "little-snitch"
# A Sophisticated CSV Editor/Viewer
cask "modern-csv"
# Native code editor
cask "nova"
# WebKit based web browser
cask "orion"
# General-purpose text editor
cask "textmate"
# File transfer application
cask "transmit"
