tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage your Java environment
brew "jenv"
# X.509 and CMS library
brew "libksba"
# YAML Parser
brew "libyaml"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Object-relational database system
brew "postgresql@15", restart_service: true, link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Make aliases for Ruby versions
brew "rbenv-aliases"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Disk space visualizer
cask "daisydisk"
# Application window manager focusing on simplicity
cask "divvy"
# Desktop client for GitHub repositories
cask "github"
# Access the HEY email service
cask "hey"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Host-based application firewall
cask "little-snitch"
# A Sophisticated CSV Editor/Viewer
cask "modern-csv"
# Native code editor
cask "nova"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# General-purpose text editor
cask "textmate"
# Open-source code editor
cask "visual-studio-code"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Boop", id: 1518425043
mas "ColorSlurp", id: 1287239339
mas "Cooler", id: 677535539
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "HTML Editor", id: 1580431405
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "iWriter Pro", id: 893199093
mas "Keynote", id: 409183694
mas "Markdown Editor Pro", id: 1453295546
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
